In [2]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [2]:
labels  = ['a','b','c']
my_list=[10,20,30]
arr = np.array([10,20,30])
d = {'a':10, 'b':20, 'c':30}

In [11]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [12]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [23]:
pd.Series(data=np.array(0))

0    0
dtype: object

In [17]:
pd.Series(data=d)

a    10
b    20
c    30
dtype: int64

In [28]:
pd.Series(labels,my_list)
# or pd.Series(data = my_list, index = labels)

10    a
20    b
30    c
dtype: object

In [3]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [7]:
my_list = ["USA","Germany","USSR","Japen"]
labels=1,2,3,4
ser1 = pd.Series(labels,my_list)
ser1
# ser1 = pd.Serise([1,2,3,4], index = ["USA","Germany","USSR","Japen"])

USA        1
Germany    2
USSR       3
Japen      4
dtype: int64

In [10]:
ser1["USA"] # 메뉴얼 방식
# or ser1[0] 디폴트 방식

1

# 컬럼 불러오기 & 추가하기

In [31]:
np.random.seed(5)

df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

df[["W"]]

# randn(row, column)

          W
A  0.441227
B  0.109610
C  0.187603
D -0.358829
E  1.151391

In [81]:
np.random.seed(5)

df = pd.DataFrame(randn(5,1),index='A B C D E'.split(),columns='W'.split())

df
# or df["W"] or df[[w]]
# Dataframe의 column 불러오기 연습

          W
A  0.441227
B -0.330870
C  2.430771
D -0.252092
E  0.109610

In [32]:
df[["W","Z"]]

          W         Z
A  0.441227 -0.252092
B  0.109610 -0.591637
C  0.187603 -0.204877
D -0.358829 -0.700179
E  1.151391  0.644848

In [82]:
np.random.seed(5)

df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

df

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

In [20]:
df['new']=df["W"]+df["Y"]
df

          W         X         Y         Z       new
A  0.441227 -0.330870  2.430771 -0.252092  2.871999
B  0.109610  1.582481 -0.909232 -0.591637 -0.799623
C  0.187603 -0.329870 -1.192765 -0.204877 -1.005161
D -0.358829  0.603472 -1.664789 -0.700179 -2.023617
E  1.151391  1.857331 -1.511180  0.644848 -0.359789

Pandan의 dataframe을 통해 culumn 삭제

In [21]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

In [22]:
df

          W         X         Y         Z       new
A  0.441227 -0.330870  2.430771 -0.252092  2.871999
B  0.109610  1.582481 -0.909232 -0.591637 -0.799623
C  0.187603 -0.329870 -1.192765 -0.204877 -1.005161
D -0.358829  0.603472 -1.664789 -0.700179 -2.023617
E  1.151391  1.857331 -1.511180  0.644848 -0.359789

In [23]:
df.drop('new',axis=1,inplace=True)
# Inplace = True 라는 내용을 추가하면, df의 내용에 절대적으로 영향을 미침

In [24]:
df

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

Row를 drop하는 연습

In [25]:
df.drop('E')
# df.drop("E",axis=0)

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179

왜, row를 drop할 때는 axis를 넣지 않아도 될까요?

axis = 0은 없는것과 같기에 생략이 가능해서

In [16]:
df.drop('E',inplace=True)

In [17]:
df

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179

In [26]:
df.shape

(5, 4)

Tuple형태, 앞에 5는 row 수, 해당 인덱스는 0

뒤에 4는 column수, 해당 인덱스는 1

Asix는 축이라는 뜻

In [29]:
df.loc[["A"]]

          W        X         Y         Z
A  0.441227 -0.33087  2.430771 -0.252092

In [33]:
df.loc['A']

W    0.441227
X   -0.330870
Y    2.430771
Z   -0.252092
Name: A, dtype: float64

In [37]:
df.iloc[0]

W    0.441227
X   -0.330870
Y    2.430771
Z   -0.252092
Name: A, dtype: float64

In [38]:
df.loc[["B"]]

         W         X         Y         Z
B  0.10961  1.582481 -0.909232 -0.591637

In [39]:
df[["Y"]]

          Y
A  2.430771
B -0.909232
C -1.192765
D -1.664789
E -1.511180

In [42]:
df.loc['B',"Y"]

-0.9092324048562419

In [44]:
df.loc[["A","B"],["W","Y"]]

          W         Y
A  0.441227  2.430771
B  0.109610 -0.909232

Dataframe의 conditional selection(조건부 선택)

In [45]:
df

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

df가 0보다 같거나 큰 것을 걸러내는 방법

In [49]:
df>=0

       W      X      Y      Z
A   True  False   True  False
B   True   True  False  False
C   True  False  False  False
D  False   True  False  False
E   True   True  False   True

In [77]:
df

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

컬럼 W에 음수가 있을 경우, 

해당 row를 제외한 테이블을 출력하는 코딩을 하세요.

In [94]:
df[df["W"]>0]

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
E  1.151391  1.857331 -1.511180  0.644848

위 결과 중 Y 컬럼만 나오도록 하세요

In [96]:
df[df["W"]>0][["Y"]]

          Y
A  2.430771
B -0.909232
C -1.192765
E -1.511180

X, Y 컬럼이 나오도록 하세요.

In [99]:
df[df["W"]>0][["X","Y"]] # 테이블

          X         Y
A -0.330870  2.430771
B  1.582481 -0.909232
C -0.329870 -1.192765
E  1.857331 -1.511180

In [98]:
df[df["W"]>0]["Y"]

A    2.430771
B   -0.909232
C   -1.192765
E   -1.511180
Name: Y, dtype: float64

컬럼 W에 음수가 있을 경우, 해당 row를 제외한 테이블이 출력되도록 하고, 

그 내용 중, Y컬럼의 Value가 1보다 큰 값들만 출력되도록 하세요.

In [128]:
df[(df["W"]>0)&(df["Y"]>1)]
# 두가지 조건을 성립하기 위해 and를 붙힘

          W        X         Y         Z
A  0.441227 -0.33087  2.430771 -0.252092

More Index Details

pd.DataFrame(data명, index, columns)

pd.DataFrame(data를 산출하는 함수(사이즈), index, columns)

In [24]:
score1=[[40,30,60,100],[90,100,20,30],[50,20,90,99],[10,40,100,90]]
df_score = pd.DataFrame(score1,index="John Mary Peter Paul".split(), columns="Math Science English Coding".split())

df_score
# df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

# df

       Math  Science  English  Coding
John     40       30       60     100
Mary     90      100       20      30
Peter    50       20       90      99
Paul     10       40      100      90

In [27]:
df_score.loc['Titus']=[80,30,60,90,260]

df_score

       Math  Science  English  Coding   총점
John     40       30       60     100  230
Mary     90      100       20      30  240
Peter    50       20       90      99  259
Paul     10       40      100      90  240
Titus    80       30       60      90  260

In [35]:
df_score["Music"]=[90,30,40,20,10]

In [51]:
# df_score.drop("총점",axis=1,inplace=True)
df_score = df_score[['Math', 'Science', 'English', 'Coding', 'Music', '총점']]

컬럼명 재정렬을 위해 위 코드가 필요

In [52]:
df_score['총점'] = df_score['Math']+df_score['Science']+df_score['English']+df_score["Coding"]+df_score["Music"]
df_score

       Math  Science  English  Coding  Music   총점
John     40       30       60     100     90  320
Mary     90      100       20      30     30  270
Peter    50       20       90      99     40  299
Paul     10       40      100      90     20  260
Titus    80       30       60      90     10  270

In [53]:
df_score

       Math  Science  English  Coding  Music   총점
John     40       30       60     100     90  320
Mary     90      100       20      30     30  270
Peter    50       20       90      99     40  299
Paul     10       40      100      90     20  260
Titus    80       30       60      90     10  270

In [59]:
df_score["평균"]=(df_score["Math"]+df_score["Science"]+df_score["English"]+df_score["Coding"]+df_score["Music"])/5
df_score

       Math  Science  English  Coding  Music   총점    평균
John     40       30       60     100     90  320  64.0
Mary     90      100       20      30     30  270  54.0
Peter    50       20       90      99     40  299  59.8
Paul     10       40      100      90     20  260  52.0
Titus    80       30       60      90     10  270  54.0

In [63]:
df_score[(df_score['Coding']>50)&(df_score["Math"]>50)]

       Math  Science  English  Coding  Music   총점    평균
Titus    80       30       60      90     10  270  54.0

& : and, 교집합, 다중의 조건을 모두 만족시킴

| : or, 합집합, 다중의 조건 중 하나만 만족시켜도 okay

In [80]:
df

['CA', 'NY', 'WY', 'OR', 'CO']

In [83]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.441227 -0.330870  2.430771 -0.252092
1     B  0.109610  1.582481 -0.909232 -0.591637
2     C  0.187603 -0.329870 -1.192765 -0.204877
3     D -0.358829  0.603472 -1.664789 -0.700179
4     E  1.151391  1.857331 -1.511180  0.644848

index를 default로 만들어줌

In [84]:
# df
newind = "CA NY WY OR CO".split()
df['States'] = newind
df

          W         X         Y         Z States
A  0.441227 -0.330870  2.430771 -0.252092     CA
B  0.109610  1.582481 -0.909232 -0.591637     NY
C  0.187603 -0.329870 -1.192765 -0.204877     WY
D -0.358829  0.603472 -1.664789 -0.700179     OR
E  1.151391  1.857331 -1.511180  0.644848     CO

In [85]:
df.set_index("States")

               W         X         Y         Z
States
CA      0.441227 -0.330870  2.430771 -0.252092
NY      0.109610  1.582481 -0.909232 -0.591637
WY      0.187603 -0.329870 -1.192765 -0.204877
OR     -0.358829  0.603472 -1.664789 -0.700179
CO      1.151391  1.857331 -1.511180  0.644848

In [86]:
df

          W         X         Y         Z States
A  0.441227 -0.330870  2.430771 -0.252092     CA
B  0.109610  1.582481 -0.909232 -0.591637     NY
C  0.187603 -0.329870 -1.192765 -0.204877     WY
D -0.358829  0.603472 -1.664789 -0.700179     OR
E  1.151391  1.857331 -1.511180  0.644848     CO

In [88]:
df.set_index("States",inplace=True)
df

               W         X         Y         Z
States
CA      0.441227 -0.330870  2.430771 -0.252092
NY      0.109610  1.582481 -0.909232 -0.591637
WY      0.187603 -0.329870 -1.192765 -0.204877
OR     -0.358829  0.603472 -1.664789 -0.700179
CO      1.151391  1.857331 -1.511180  0.644848

# 다중 인덱스와 인덱스 간의 계층

In [97]:
# index Levels
outside = ['G1','G1',"G1","G2","G2","G2"]
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [98]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [99]:
inside

[1, 2, 3, 1, 2, 3]

In [101]:
df = pd.DataFrame(np.random.randn(6,2),index = hier_index,columns=['A',"B"])

In [102]:
df

             A         B
G1 1 -0.006195 -0.101068
   2 -0.052308  0.249218
   3  0.197660  1.334849
G2 1 -0.086876  1.561532
   2 -0.305853 -0.477731
   3  0.100738  0.355438

In [109]:
df.loc['G1']

          A         B
1 -0.006195 -0.101068
2 -0.052308  0.249218
3  0.197660  1.334849

In [121]:
df.loc["G1"].iloc[1]

A   -0.052308
B    0.249218
Name: 2, dtype: float64

In [128]:
score = [[30,60],[100,50],[10,20],[90,80],[44,41],[70,77]]
df_score2 = pd.DataFrame(score,index=hier_index,columns=["수학","영어"])
df_score2

       수학  영어
G1 1   30  60
   2  100  50
   3   10  20
G2 1   90  80
   2   44  41
   3   70  77

In [158]:
df_score2.loc["G1"].loc[1]["영어"]

60

In [162]:
df_score2.loc["G2"].loc[2]["수학"]

44

# 인덱스 이름 재설정

In [166]:
df_score2.index.names=['반','번호']
df_score2

        수학  영어
반  번호
G1 1    30  60
   2   100  50
   3    10  20
G2 1    90  80
   2    44  41
   3    70  77